Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-5-9.tmx
Source language: bo
Languages: en

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ཐམས་ཅད་ཀྱང་རང་གི་སེམས་ཀྱི་བྱིན་གྱི་རླབས་སོ།
en: All the pure buddha realms are the blessing of one’s own mind.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡང་རང་གི་སེམས་ཀྱི་བྱིན་གྱི་རླབས་སོ།
en: The bodhisattva conduct also is the blessing of one’s own mind.

source: །སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བ་ཡང་རང་གི་སེམས་ཀྱི་བྱིན་གྱི་རླབས་སོ།
en: The ripening and guidance of all beings is the blessing of one’s own mind.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པ་ཡང་རང་གི་སེམས་ཀྱི་བྱིན་གྱི་རླབས་སོ།
en: The fulfillment of the aspirations of the bodhisattvas is the blessing of one’s own mind.

source: །ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གྲོང་ཁྱེར་དུ་ཕྱིན་པར་བྱ་བ་ཡང་རང་གི་སེམས་ཀྱི་བྱིན་གྱི་རླབས་སོ།
en: Arriving at the city of omniscience is the blessing of one’s own mind.

source: །རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པས་རྣམ་པར་རྩེ་བ་ཡང་རང་གི་སེམས་ཀྱི་བྱིན་གྱི་རླབས་སོ།
en: Delighting in inconceivable liberations is the blessing of one’s own mind.

source: །སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་ཡང་རང་གི་སེམས་ཀྱི་བྱིན་གྱི་རླབས་སོ།
en: At attainment, the enlightenment of buddhahood is the blessing of one’s own mind.

source: །ཆོས་ཀྱི་དབྱིངས་ཀུན་ནས་འདུས་པར་ཁྱུ་མཆོག་གི་མཐུ་དབྱུང་ཞིང་རྣམ་པར་འཕྲུལ་པ་ཡང་རང་གི་སེམས་ཀྱི་བྱིན་གྱི་རླབས་སོ།
en: The miraculous manifestation of the powerful majesty of uniting the entire realm of phenomena is the blessing of one’s own mind.

source: །བསྐལ་པ་ཐམས་ཅད་ཤིན་ཏུ་ཕྲ་བར་བསྡུ་བའི་ཡེ་ཤེས་ཀྱང་རང་གི་སེམས་ཀྱི་བྱིན་གྱི་རླབས་སོ། །ཞེས་བྱ་བར་ཁོང་དུ་ཆུད་ཅིང་རྗེས་སུ་རྟོགས་སོ།
en: The wisdom that unites all kalpas into a brief time is the blessing of one’s own mind.

source: །རིགས་ཀྱི་བུ་དེ་ལ་ཁོ་བོ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “Noble one, this is what I think:

source: དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱིས་ནི་རང་གི་སེམས་ཉིད་ཉེ་བར་བརྟན་པར་བྱའོ། །ཆོས་ཀྱི་སྤྲིན་གྱིས་ནི་རང་གི་སེམས་ཉིད་ཡོངས་སུ་བརླན་པར་བྱའོ། །སྒྲིབ་པའི་ཆོས་རྣམས་ལས་ནི་རང་གི་སེམས་ཉིད་ཡོངས་སུ་སྦྱང་བར་བྱའོ། །བརྩོན་འགྲུས་ཀྱིས་ནི་རང་གི་སེམས་ཉིད་བརྟན་པར་བྱའོ། །བཟོད་པས་ནི་རང་གི་སེམས་ཉིད་མཉམ་པར་བྱའོ། །ཡེ་ཤེས་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ནི་རང་གི་སེམས་ཉིད་གཞོལ་བར་བྱའོ། །ཤེས་རབ་ཀྱིས་ནི་རང་གི་སེམས་ཉིད་ཡོངས་སུ་སྦྱང་བར་བྱའོ། །དབང་རྣམས་ལ་ནི་རང་གི་སེམས་ཉིད་མངོན་པར་བསྒྲུབ་པར་བྱའོ། །སངས་རྒྱས་དང་མཉམ་པ་ཉིད་ལ་ནི་རང་གི་སེམས་ཉིད་རྒྱས་པར་བྱའོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུས་ནི་རང་གི་སེམས་ཉིད་སྣང་བར་བྱའོ་སྙམ་མོ།
en: one’s own mind should be supported by all roots of merit, one’s own mind should be moistened by the clouds of the Dharma, one’s own mind should be purified of obscuring phenomena, one’s own mind should be made firm by diligence, one’s own mind should be made tranquil by patience, one’s own mind should be cultivated by the comprehension of knowledge, one’s own mind should be refined by wisdom, one’s own mind should have accomplishment in power, one’s own mind should be made vast in the equality of the buddhas, and one’s own mind should be illuminated by the ten strengths of the tathāgatas.

source: །རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་ཐར་པ་ཐོགས་པ་མེད་པའི་རྒྱན་འདི་ཤེས་ཏེ། བླངས་ཤིང་ཡོངས་སུ་འཛིན་པར་ཟད་ན། ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་ཆགས་པ་མེད་པའི་སེམས་དང་ལྡན་པ་ཆགས་པ་མེད་པ་རྣམ་པར་སྤྱོད་པའི་སྤྱོད་ཡུལ་དང་ལྡན་པ།
en: “Noble one, I know, have adopted, and keep this liberation called the unimpeded display of the tathāgatas , but how could I know or describe the qualities of dwelling without impediment in the field of activity of the unimpeded minds of the bodhisattvas;

source: ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་ཐམས་ཅད་མངོན་སུམ་དུ་བཞུགས་པའི་ཏིང་ངེ་འཛིན་རབ་ཏུ་ཐོབ་པ།
en: the attainment of the samādhi of the direct perception of all the buddhas in the present;

source: མྱ་ངན་ལས་འདའ་བ་མྱེད་པའི་མཐའ་ལ་གནས་པའི་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སྒོའི་ཏིང་ངེ་འཛིན་རབ་ཏུ་ཐོབ་པ།
en: the attainment of the samādhi gateway to the enlightenment that has reached the apex that is without passing into nirvāṇa;

source: དུས་གསུམ་མཉམ་པ་ཉིད་དུ་གྱུར་པ།
en: the attainment of the sameness of the three times;

source: གཞི་ཀུན་ནས་ཕྱེད་པའི་ཏིང་ངེ་འཛིན་གྱི་སྤྱོད་ཡུལ་གྱི་ཚུལ་ཤེས་པ།
en: the knowledge of the way of the field of activity of the samādhi of the completely undivided basis;

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་ལུས་རྣམ་པར་བཀྲམ་པ།
en: the bodies distributed throughout all buddha realms;

source: སངས་རྒྱས་ཀྱི་ཡུལ་ཐ་མྱི་དད་པ་ལ་རྣམ་པར་སྤྱོད་པ།
en: the presence in the indivisible ranges of the buddhas;

source: ཕྱོགས་ཐམས་ཅད་དུ་མངོན་པར་ཕྱོགས་པའི་སྤྱོད་ཡུལ་དང་ལྡན་པ།
en: the field of activity that is oriented toward all directions;

source: ཕྱིན་ཕྱོགས་མེད་པའི་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་གྱིས་རྣམ་པར་ལྟ་བ་དེ་དག་གི་ལུས་ལ་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་འཇིག་ཅིང་འདུ་བར་སྣང་ཡང་དེ་དག་ལ་བདག་དང་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཉིས་ཀྱི་འདུ་ཤེས་མེད་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན།
en: the view of the domain of undivided wisdom; and the conduct that is free of the dualistic conceptions of self and world, even though in their bodies there appears the destruction and creation of all world realms? “Now depart, noble one.

source: སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ཀྱི་འཛམ་བུའི་གླིང་གི་མགོ་འགེབས་པས་རྒྱས་པར་འགེངས་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: On this road to the south, at the tip of Jambudvīpa, there is Milaspharaṇa.

source: དེ་ན་དགེ་སློང་རྒྱ་མཚོའི་རྒྱལ་མཚན་ཅེས་བྱ་བ་འདུག་གིས།
en: There dwells a bhikṣu by the name of Sāgara­dhvaja.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཚོང་དཔོན་བཏང་བརྗོད་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Go to him and ask him, ‘How should a bodhisattva train in bodhisattva conduct? How should a bodhisattva proceed?’

source: ཚོང་དཔོན་བཏང་བརྗོད་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། ཚོང་དཔོན་བཏང་བརྗོད་ཀྱི་ཡོན་ཏན་གྲངས་མེད་པ་ལ་སྙན་པར་བརྗོད་དེ། བརྟག་པ་དང་། མོས་པར་བྱ་བ་དང་། མི་བཏང་བར་བྱ་བ་སེམས་ཤིང་དུ་སྟེ་སྨྲེ་སྔགས་བཏོན་ནས།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the head merchant Muktaka, circumambulated the head merchant Muktaka a hundred thousand times, keeping him to his right, and, looking back again and again, beautifully describing, examining, and aspiring to the countless qualities of the head merchant Muktaka, thinking of Muktaka, he was weeping and wailing as he departed from head merchant Muktaka;

source: དགེ་བའི་བཤེས་གཉེན་སྡུག་པར་སེམས་ཤིང་དགེ་བའི་བཤེས་གཉེན་གྱི་རྗེས་སུ་འབྲང་བ་དང་། དགེ་བའི་བཤེས་གཉེན་ལ་བསྙེན་བཀུར་བར་མོས་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་བསྒོ་བ་དང་། མྱི་འགལ་བར་བྱེད་པ་དང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དགེ་བའི་བཤེས་གཉེན་ལ་རག་ལུས་པར་རྗེས་སུ་བལྟ་བ་དང་། དགེ་བའི་བཤེས་གཉེན་ལ་རྗེས་སུ་བསམ་པ་དང་། དགེ་བའི་བཤེས་གཉེན་ལ་གཡོ་སྒྱུ་མེད་པར་སྤྱོད་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་སེམས་ཀྱི་དབང་དུ་འགྲོ་བར་བྱ་བ་དང་ལྡན་པས་དགེ་བའི་བཤེས་གཉེན་རྣམས་གནོད་པ་ཐམས་ཅད་ཡོངས་སུ་སྤོང་བར་བྱེད་པས་མ་ཙམ་དུ་སེམས།
en: he was thinking of kalyāṇamitras with affection, trusting in them, longing to honor the kalyāṇamitras, maintaining obedience to the instructions of kalyāṇamitras, and seeing omniscience as dependent upon the kalyāṇamitras; his thoughts focused on the kalyāṇamitras, his conduct faithful to the kalyāṇamitras, and being in the power of the minds of the kalyāṇamitras, by avoiding anything that would be harmful to the kalyāṇamitras he regarded them as his mother and, by developing all the qualities of roots of merit, regarded them as his father. Sāgara­dhvaja

source: དགེ་བའི་རྩ་བ་ཡོངས་སུ་བསྐྱེད་པས་ཕ་ཙམ་དུ་སེམས་ཤིང་ཚོང་དཔོན་བཏང་བརྗོད་ཀྱི་དྲུང་ནས་སོང་ངོ་།
en: Sudhana, the head merchant’s son, contemplated the teaching of the head merchant Muktaka and dedicated himself to the instructions of the head merchant Muktaka.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཚོང་དཔོན་བཏང་བརྗོད་ཀྱིས་བསྟན་པ་དེ་ལ་རྗེས་སུ་སེམས་ཤིང་།
en: He followed the inconceivable bodhisattva liberations. He called to mind the inconceivable radiance of bodhisattva wisdom. He practiced entering and comprehending the inconceivable realm of the Dharma. He comprehended the inconceivable bodhisattva methods of gathering pupils. He reflected on the inconceivable miracles of the tathāgatas. He aspired to the inconceivable aggregation of buddha realms.

source: ཚོང་དཔོན་བཏང་བརྗོད་ཀྱི་གདམས་ངག་ལ་ནན་ཏན་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་རྗེས་སུ་དྲན་པར་བྱ་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ལ་འཇུག་ཅིང་འབབ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡོངས་སུ་འདུ་བར་བྱ་བའི་ཚུལ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་འཇུག་པར་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྗེས་སུ་བལྟ་བར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་བསྡུ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མོས་པར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱི་རྒྱན་རྗེས་སུ་སྦྱང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་དང་། རྣམ་པར་ཐར་པའི་རྣམ་པར་དགོད་པ་དང་། ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་བསམ་གྱིས་མྱི་ཁྱབ་པ་ལ་ཡོངས་སུ་བརྟག་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཐ་དད་པ་ལ་སྒྲིབ་པ་མེད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་འཇུག་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལས་ལ་བསམ་པ་ཤིན་ཏུ་བརྟན་པ་དེ་ལ་ནན་དུ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལས་དང་། སྨོན་ལམ་གྱི་རྒྱུད་བསམ་གྱིས་མི་ཁྱབ་པ་དེའི་རྗེས་སུ་སྤྱོད་ཅིང་མཐར་གྱིས་འཛམ་བུ་གླིང་གི་མགོ་འགེབས་པས་རྒྱས་པར་འགེངས་པ་ཞེས་བྱ་བ་གང་ན་བ་དེར་ཕྱིན་ནས།
en: He contemplated the display of the blessings of the buddhas. He examined the inconceivable majestic power of the display of samādhis and liberations. He was dedicated to entering inconceivable separate, unobscured world realms. He developed the aspiration for inconceivable, enduring bodhisattva activity. And he adopted the inconceivable continuum of bodhisattva activity and prayer. Eventually he reached Milaspharaṇa at the tip of Jambudvīpa.

source: དགེ་སློང་རྒྱ་མཚོའི་རྒྱལ་མཚན་ཚོལ་ཚོལ་བ་ལས།
en: He searched and searched for the bhikṣu Sāgara­dhvaja.

source: འཆག་པའི་གནས་ཤིག་གི་འཆག་པའི་མཐར་འདུག་སྟེ།
en: Sudhana saw him sitting at the end of a meditation walkway.

source: ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་བཞག་ནས་དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་མེད་ཅིང་མྱི་གཡོ་ལ་བྱེད་པ་མེད་ཅིང་ལུས་དྲང་པོར་བསྲང་སྟེ།
en: He was resting in samādhi with no inhalation or exhalation of breath, unmoving, inactive, sitting with his body upright, and manifesting mindfulness.

source: དྲན་པ་མངོན་དུ་བྱས་ནས་ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མྱི་ཁྱབ་པར་རྣམ་པར་འཕྲུལ་ཞིང་གཡས་གཡོན་དང་། སྟེང་ལོགས་སུ་ལུས་མཐའ་ཡས་ལ་ཚད་མེད་ཅིང་བསམ་གྱིས་མི་ཁྱབ་པ་སྤྱི་གཙུག་བལྟར་མི་མཐོང་བ། ཁ་དོག་དུ་མའི་ལུས་དང་ལྡན་པ་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཁ་དོག་རྣམ་པ་ཐ་དད་པ་ཚད་མེད་པ་ཡོངས་སུ་སྟོན་པ་དེ།
en: With the inconceivable miraculous powers of samādhi, he miraculously manifested an inconceivable, immeasurable, infinite body to the right, left, and above, so that the crown of his head was beyond sight. His body had many colors, manifesting countless different colors in each instant of the mind.

source: དེ་དེ་ལྟར་མཉམ་པར་བཞག་ཅིང་ཟབ་ལ་ཞི་སྟེ། གཡོ་བ་མེད་ཅིང་དམིགས་པ་མེད་ལ་དགའ་བས་ལུས་མཐོ་བར་གྱུར་པ་དེའི་བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པས་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་རབ་ཏུ་འགྱེད་པར་བྱེད་ཅིང་འདུག་པ་མཐོང་ངོ་།
en: Sudhana saw that as Sāgara­dhvaja rested in that way in a profound, peaceful, motionless, objectless meditation, from all the pores of his body, which had become tall through joy, countless miraculous manifestations of bodhisattva liberation appeared.

source: །རྣམ་པར་ཐར་པས་རྣམ་པར་འཕྲུལ་པ་དེའི་མཐུས་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མཆོད་པ་སྦྱར་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་གྱི་ཕུང་པོ་རྣམ་པར་བཟློག་པ་དང་། ངན་སོང་གི་ལམ་ཐམས་ཅད་ཡོངས་སུ་གཅད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བདེ་བའི་ལམ་གྱི་སྒོ་དབྱེ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་གདུང་བ་རབ་ཏུ་ཞི་བར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་མི་ཤེས་པའི་སྒྲིབ་པ་རྣམ་པར་གཏོར་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་དགོད་པའི་ཕྱིར་རྣམ་པར་འཕྲུལ་པའི་བྱེ་བྲག་རྣམ་པ་སྣ་ཚོགས་མཐའ་ཡས་པས་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་ཤིང་དེའི་རྐང་པའི་མཐིལ་གཉིས་ནས།
en: In every single instant of mind, those miraculous manifestations from the gateway of liberation spread throughout the realm of phenomena, in order that those infinite miraculous manifestations would ripen all beings, make offerings to all the tathāgatas, purify all buddha realms, eliminate the mass of suffering of all beings, close all the paths to the lower existences, open the paths to happiness for all beings, end the affliction of the kleśas for all beings, disperse the obscuration of ignorance in all beings, and establish all beings in omniscience. Sudhana saw assemblies of head merchants, as numerous as the atoms in countless buddha realms, being emanated from the soles of Sāgara­dhvaja’s feet.

source: ཚོང་དཔོན་གྱི་ཚོགས་བཀུར་སྟི་དང་། རིམ་གྲོ་སྣ་ཚོགས་བྱེད་པ་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་གཏོགས་པའི་ཚོང་དཔོན་དང་འདྲ་བའི་གཟུགས་དང་ལྡན་པ་ལྷག་པའི་ཡུལ་ལ་སྤྱོད་པ། རྒྱན་སྣ་ཚོགས་ཀྱིས་ལུས་ཤིན་ཏུ་ཀླུབས་པ། ཐོར་ཚུགས་དང་གཙུག་གི་རིན་པོ་ཆེ་དང་། ཅོད་པན་སྣ་ཚོགས་ཐོགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱིས་པ་བྱེ་བ་འཕྱེས་པའི་འཁོར་དང་ལྡན་པ་བྱུང་བ་མཐོང་ངོ་།
en: They attended and waited on him in various ways, and, appearing to be all the head merchants from all world realms, forming an exceptional field of activity, their bodies were adorned by a variety of ornaments with various kinds of topknots, crest jewels, and crowns, and they were accompanied by the images of entourages of their children.

source: །བྲམ་ཟེ་དང་ཁྱིམ་བདག་མང་པོའི་བཟའ་བཏུང་རྣམ་པ་མང་པོ་དང་། རོའི་ཡན་ལག་སྣ་ཚོགས་སུ་སྦྱར་བ་ཐམས་ཅད་དང་། རྒྱན་ཐམས་ཅད་དང་། གོས་ཐམས་ཅད་དང་། མེ་ཏོག་ཐམས་ཅད་དང་། ཕྲེང་བ་ཐམས་ཅད་དང་། སྤོས་ཐམས་ཅད་དང་། བྱུག་པ་ཐམས་ཅད་དང་། འདོད་པའི་ཡོད་བྱད་ཐམས་ཅད་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་དང་། གནས་ཐམས་ཅད་དང་། སྣོད་རྣམ་པ་སྣ་ཚོགས་ཐམས་ཅད་དང་། ཡོ་བྱད་རྣམ་པ་སྣ་ཚོགས་ཐམས་ཅད་ཀྱིས་སེམས་ཅན་དབུལ་པོ་རྣམས་ཡོངས་སུ་སྡུད་ཅིང་།
en: Sudhana also saw attending brahmins and householders, each with different kinds of food and drink with combinations of various flavors, all adornments, all clothes, all flowers, all garlands, all perfumes, all ointments, all desirable things, all jewels, all seats, all vessels of various kinds, and all kinds of utensils.

source: འགྲོ་བ་སྡུག་བསྔལ་བ་རྣམས་དབུགས་དབྱུང་བ་དང་། སེམས་ཅན་གྱི་སེམས་ཚིམ་པར་བྱ་བ་དང་། སེམས་ཅན་གྱི་བསམ་པ་རྣམ་པར་དག་པར་བྱ་བ་དང་། སེམས་ཅན་རྣམས་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱེད་ཅིང་ཕྱོགས་བཅུ་བཀང་སྟེ།
en: They were emanated out into the ten directions, where they were gathering poor people and relieving beings of their suffering, purifying the thoughts of beings, satisfying the minds of beings, and ripening beings for enlightenment.

source: འདོང་བ་མཐོང་ངོ་། །པུས་མོའི་ལྷ་ང་གཉིས་ན་རྒྱལ་རིགས་མཁས་པའི་གཟུགས་དང་། བྲམ་ཟེ་མཁས་པའི་གཟུགས་དང་། འཇིག་རྟེན་ན་མཁས་པའི་གཟུགས་དང་། བཟོ་སྣ་ཚོགས་ལ་མཁས་པའི་གཟུགས་དང་། མིའི་འགྲོ་བའི་རྒྱུད་ན་མཁས་པའི་གཟུགས་དང་། འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ལས་ཀྱི་ཚུལ་དང་། རྒྱུས་ལ་གསལ་ཞིང་མཁས་པའི་གཟུགས་དང་། འཇིག་རྟེན་གྱི་སློབ་དཔོན་དུ་བྱ་བར་མཁས་པའི་གཟུགས་ཆ་བྱད་རྣམ་པ་དུ་མ་དང་ལྡན་པ། དབྱིབས་དང་རྒྱན་རྣམ་པ་དུ་མ་དང་ལྡན་པ། ཡིད་དུ་འོང་བའི་ཚིག་མང་པོ་བརྗོད་པས། ཡིད་མི་བདེ་བའི་སེམས་ཅན་རབ་ཏུ་དགའ་བར་བྱེད་ཅིང་ཆོས་ཀྱི་ནོར་གྱིས་དབུལ་བའི་སེམས་ཅན་རྣམས་ལ་ཕན་གདགས་པ་དང་། སྡུག་བསྔལ་བའི་སེམས་ཅན་རྣམས་བདེ་བར་བྱ་བ་དང་། ལོག་པར་ལྟུང་བའི་སེམས་ཅན་རྣམས་མངོན་པར་གདོན་པ་དང་། ཐེག་པའི་གྲུ་ལ་ཉམ་ཉེས་སུ་གྱུར་པའི་སེམས་ཅན་རྣམས་དབུགས་དབྱུང་བ་དང་། འཇིགས་པའི་སེམས་ཅན་རྣམས་ཡོངས་སུ་བསྐྱབ་པ་དང་། དགེ་བའི་རྩ་བའི་སྒྲ་ཀུན་ཏུ་གྲགས་པར་བྱ་བ་དང་། སྡིག་པ་ལས་བཟློག་པའི་སྒྲ་ཡོངས་སུ་བསྒྲག་པ་དང་། དགེ་བའི་ཆོས་ཡང་དག་པར་བླང་བ་ལ་སེམས་ཅན་གཟུང་བ་དང་། དོན་སྤྱོད་པ་ལ་སེམས་ཅན་དགོད་པ་དང་། དགའ་བའི་ཤུགས་ཡོངས་སུ་བསྐྱེད་པ་དང་། སྙན་པར་སྨྲ་བའི་བསྡུ་བའི་དངོས་པོ་ཡོངས་སུ་བརྗོད་པ་དང་། འཇིག་རྟེན་ལ་དོན་མཐུན་པར་བསྒྲུབ་པ་སྟོན་པར་བྱེད་ཅིང་ཕྱོགས་བཅུ་རྒྱས་པར་བཀང་སྟེ་འདོང་བ་མཐོང་ངོ་།
en: Sudhana saw Sāgara­dhvaja’s knees emanating and filling the ten direction with the forms of wise kṣatriyas, the forms of wise brahmins, the forms of those who were wise in worldly matters, the forms of those wise in various arts and crafts, the forms of those wise concerning human existence, the forms of those wise with the knowledge of carrying out both worldly and nonworldly practices, and the forms of those wise in honorable worldly conduct, taking on various forms, displaying the presence of many forms, speaking with pleasant words, making unhappy beings happy, caring for poor beings devoid of the wealth of the Dharma, making beings who are suffering happy, elevating beings who have fallen down, bringing relief to those who are shipwrecked, saving beings who are in fear, sounding out the words of all roots of merit, emitting the words of turning away from bad actions, bringing beings to the adoption of good qualities, establishing beings in beneficial conduct, engendering the power of joy, emitting pleasant words that are a method of gathering pupils, and showing consistency of words and actions to the world.

source: །ལྟེ་བའི་དཀྱིལ་འཁོར་ནས་དྲང་སྲོང་མང་པོ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་ལུས་ཀྱི་དབྱིབས་སུ་འཁོད་པ། པགས་པ་དང་ཤུན་པའི་གོས་གྱོན་པ་རིལ་བ་ཐོགས་པ། གཟུགས་དང་ཆ་བྱད་དང་དབྱིབས་སྣ་ཚོགས་ཅན་སྤྱོད་ལམ་རབ་ཏུ་ཞི་བ་དག་བྱུང་བས། སྟེང་གི་བར་སྣང་ལས་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་བརྗོད་པ་བྱེད་ཅིང་།
en: Sudhana saw, issuing forth from Sāgara­dhvaja’s navel, a multitude of ṛṣis manifesting as the bodies of all beings, wearing robes of antelope skins and bark, holding staffs and burl bowls, with various forms, features , and appearances, and having a peaceful deportment.

source: ཆོས་ཀྱི་སྒྲ་ཡོངས་སུ་བསྒྲག་པ་དང་། སངས་རྒྱས་ཀྱི་སྒྲ་བརྗོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཡོངས་སུ་བསྟན་པ་དང་། ཚངས་པའི་སྤྱོད་པ་ཡོངས་སུ་བརྗོད་པ་དང་། དབང་པོ་དབེན་པ་ལ་སེམས་ཅན་དགོང་པ་དང་། རང་བཞིན་མེད་པའི་དོན་རབ་ཏུ་བརྟག་པ་དང་། ཡེ་ཤེས་ཀྱི་དོན་ལ་འཇིག་རྟེན་རབ་ཏུ་དགོད་པ་དང་། འཇིག་རྟེན་གྱི་གཙུག་ལག་གི་རྣམ་པ་ཡོངས་སུ་བརྗོད་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱིས་འབྱུང་བའི་ལམ་གྱི་ཚུལ་རབ་ཏུ་བསྟན་པ་དང་། མཐར་གྱིས་བྱ་བའི་ལས་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་བྱེད་ཅིང་། ཕྱོགས་བཅུ་བཀང་སྟེ་འདོང་བ་མཐོང་ངོ་། །རྩིབ་ལོགས་གཉིས་ནས།
en: From up in the sky they were proclaiming the qualities of a buddha, speaking the word Dharma , uttering the word Buddha , teaching the bodhisattva Saṅgha, describing the path of celibacy, establishing beings in restraining the senses, expounding the meaning of the absence of intrinsic nature, establishing the world in the meaning of wisdom, guiding in the ways of worldly treatises, teaching the way of the path that gives rise to omniscience, and establishing beings in the succession of practices.

source: ཀླུའི་བུ་མོ་འཇིག་རྟེན་རྒྱུ་བ་ཐམས་ཅད་ཀྱི་གྲངས་དང་མཉམ་པ།
en: Sudhana, the head merchant’s son, saw, issuing forth from the sides of Sāgara­dhvaja’s upper body, nāga maidens as numerous as all the worlds in existence, and in each instant of mind pervading the entire realm of phenomena.

source: ལུས་ཀྱི་དབྱིབས་བསམ་གྱིས་མི་ཁྱབ་པ་དུ་མ་དང་ལྡན་པ་བྱུང་སྟེ་ཀླུའི་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་བསྟན་པ་དང་། སྤོས་ཀྱི་སྤྲིན་གྱི་རྒྱན་བསམ་གྱིས་མི་ཁྱབ་པ་ནམ་མཁའི་དབྱིངས་ལ་བྱིན་གྱིས་བརླབ་པ་དང་། མེ་ཏོག་གི་སྤྲིན་གྱི་རྒྱན་བསམ་གྱིས་མི་ཁྱབ་པས་ནམ་མཁའི་དབྱིངས་ཐམས་ཅད་བརྒྱན་པ་དང་། ཕྲེང་བའི་སྤྲིན་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་གྱིས་ནམ་མཁའི་དབྱིངས་ཐམས་ཅད་རྣམ་པར་ཀླུབས་པ་དང་། རིན་པོ་ཆེའི་གདུགས་ཀྱི་སྤྲིན་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་གྱིས།
en: They were appearing as inconceivably numerous bodies, manifesting an inconceivable number of nāga miracles, establishing in the sky an inconceivable adornment of clouds of scented water, adorning the sky with the inconceivable adornment of clouds of flowers, arraying the entire sky with the inconceivable adornment of clouds of garlands, and covering the entire realm of phenomena with the inconceivable adornment of clouds of precious parasols; with the inconceivable adornment of clouds of precious banners; with the inconceivable adornment of clouds of precious streamers;

source: །ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ཡོངས་སུ་ཁེབས་པར་བྱ་བ་དང་། རིན་པོ་ཆེའི་རྒྱལ་མཚན་གྱི་སྤྲིན་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་དང་། རིན་པོ་ཆེའི་ལྷའི་བ་དན་གྱི་སྤྲིན་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་དང་། རིན་པོ་ཆེའི་ཕྱང་འཕྲུལ་སྣ་ཚོགས་ཀྱི་སྤྲིན་དང་། ཆར་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་དང་། ནོར་བུ་རིན་པོ་ཆེ་དམ་པའི་སྤྲིན་གྱི་ཆར་འབབ་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་དང་། རིན་པོ་ཆེའི་སེ་མོ་དོ་སྣ་ཚོགས་དང་། མེ་ཏོག་གི་སྤྲིན་གྱི་ཆར་བསམ་གྱིས་མི་ཁྱབ་པའི་བརྒྱན་དང་། རིན་པོ་ཆེའི་ཁྲི་ལ་སྐྱིལ་མོ་ཀྲུང་དུ་འཁོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་བསམ་གྱིས་མི་ཁྱབ་པ་འབེབས་པའི་རྒྱན་དང་། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་རྒྱན་སྣ་ཚོགས་དང་ལྡན་པའི་ལྷའི་བུ་མོ་མང་པོ་ཆོས་ཀྱི་གླུ་སྙན་པའི་སྒྲ་དབྱངས་ཀྱི་སྤྲིན་གྱི་ཆར་འབེབས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། རིན་པོ་ཆེའི་པད་མོ་ཟེ་བ་མཐོ་བ་མུ་ཏིག་གི་དྲ་བས་བརྒྱན་པ།
en: with the inconceivable adornment of the rain from clouds of various pendant ornaments; with the inconceivable adornment of the rain from clouds of excellent precious jewels; with the inconceivable adornment of the rain from clouds of various precious necklaces and flowers; with the inconceivable adornment of the rain from clouds of the Dharma of buddhas and bodhisattvas seated cross-legged on precious thrones; with the inconceivable adornment of the rain from clouds of the sound of the Dharma songs of a multitude of apsarases wearing a variety of divine, precious jewelry;

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་ཐམས་ཅད་ཀྱི་འབྲུའི་སྤྲིན་གྱི་ཆར་རྣམ་པར་འཐོར་བ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་དང་། རིན་པོ་ཆེའི་ཅོད་པན་གྱི་སྤྲིན་ནོར་བུ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་རབ་ཏུ་བརྒྱན་པ་དང་། འོད་ཟེར་གྱི་སྤྲིན་མཐའ་ཡས་པའི་ཆར་འབེབས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་དང་། ལྷའི་ལུས་ཀྱི་སྤྲིན་གྱི་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། ལྷའི་བ་དན་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་དང་། ལྷའི་བུ་མོ་མང་པོའི་ལུས་ཀྱི་སྤྲིན་ཐལ་མོ་སྦྱར་ཏེ།
en: with the inconceivable adornment of the scattering rain from clouds of precious lotuses adorned with strings of pearls with tall anthers and pollen of all kings of jewels; with the inconceivable adornment of the rain from clouds of precious crowns adorned with all precious jewels and clouds of endless light rays; with the inconceivable adornment of the rain from clouds of the bodies of devas adorned by flowers, garlands, parasols, banners, and streamers;

source: གསེར་གྱི་མེ་ཏོག་སྙིམ་པས་འདོར་བ། དེ་བཞིན་གཤེགས་པ་ལ་ཡོན་ཏན་དང་། ལེགས་པ་ཐམས་ཅད་དུ་བསྟོད་པའི་སྤྲིན་གྱི་འབྲུག་སྒྲ་འབྱིན་ཅིང་ཆར་འབེབས་པ། བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་ནམ་མཁའི་དབྱིངས་ལ་བྱིན་གྱིས་རློབ་ཅིང་།
en: and with the inconceivable adornment of the rain and thunder from clouds of the bodies of multitudes of apsarases scattering golden flowers from between their hands conjoined in homage and praising all the qualities and excellences of the tathāgatas.

source: སྤོས་ཀྱི་ཕུང་པོའི་སྤྲིན་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཁ་དོག་ཏུ་འདུག་པ་དང་། བདུག་སྤོས་ཀྱི་ན་བུན་དང་སྤྲིན་ཤིན་ཏུ་རྒྱ་ཆེ་བས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་མངོན་པར་ཁེབས་པར་བྱ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་རབ་ཏུ་བརྒྱན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་དགའ་བར་བྱ་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་མཆོད་པས་སྐད་ཅིག་སྐད་ཅིག་ཏུ་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་ངོ་། །མཐོང་ཀའི་དཔལ་གྱི་བེའུ་ནས་ལྷ་མ་ཡིན་གྱི་དབང་པོ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་སྟེ།
en: Vast clouds and mists of the best incense stationed in the sky, together with the clouds of heaps of scented waters with the colors of all jewels, covered the assemblies of the followers of all tathāgatas, adorned the entire extent of world realms, brought happiness to all beings, and made offerings to all the buddhas. Sudhana saw, issuing forth from the śrīvatsa on Sāgara­dhvaja’s chest, asura lords as numerous as the atoms in countless buddha realms, in each instant of mind pervading the realm of phenomena and manifesting networks of inconceivable, miraculous asura conjurations; agitating oceans; causing a hundred thousand world realms to tremble; dashing together all the sovereign lords of mountains; causing all the residences of the devas to tremble; overwhelming all the domains of māras; crushing all the armies of māras;
